> # Test route_earliest_arrival
> clear_all
Cleared all stations
> clear_trains
All trains removed.
> station_count
Number of stations: 0
> # Add stations
> add_station Id1 "One" (11,12)
Station:
   One: pos=(11,12), id=Id1
> add_station Id2 "Two" (21,22)
Station:
   Two: pos=(21,22), id=Id2
> add_station Id3 "Three" (13,20)
Station:
   Three: pos=(13,20), id=Id3
> station_count
Number of stations: 3
> # Add trains
> add_train T12e Id1:0800 Id2:0900
1. One (Id1) -> Two (Id2): T12e (at 0800)
2. Two (Id2): T12e (at 0900)
> add_train T12l Id1:0830 Id2:0930
1. One (Id1) -> Two (Id2): T12l (at 0830)
2. Two (Id2): T12l (at 0930)
> add_train T23e Id2:0900 Id3:1000
1. Two (Id2) -> Three (Id3): T23e (at 0900)
2. Three (Id3): T23e (at 1000)
> add_train T23l Id2:1000 Id3:1100
1. Two (Id2) -> Three (Id3): T23l (at 1000)
2. Three (Id3): T23l (at 1100)
> # Test basic routing
> route_earliest_arrival Id1 Id2 0800
Total time for the route 1 hours 0 minutes.
1. One (Id1) -> Two (Id2) (at 0800)
2. Two (Id2) (at 0900)
> route_earliest_arrival Id2 Id3 0930
Total time for the route 1 hours 30 minutes.
1. Two (Id2) -> Three (Id3) (at 1000)
2. Three (Id3) (at 1100)
> route_earliest_arrival Id1 Id3 0600
Total time for the route 4 hours 0 minutes.
1. One (Id1) -> Two (Id2) (at 0800)
2. Two (Id2) -> Three (Id3) (at 0900)
3. Three (Id3) (at 1000)
> route_earliest_arrival Id1 Id3 0801
Total time for the route 2 hours 59 minutes.
1. One (Id1) -> Two (Id2) (at 0830)
2. Two (Id2) -> Three (Id3) (at 1000)
3. Three (Id3) (at 1100)
> route_earliest_arrival Id3 Id2 0000
No route found!
> # Test non-existing station
> route_earliest_arrival Id1 Id4 0000
Starting or destination station not found!
> # Test Non-existing route
> add_station Id4 "Four" (20, 14)
Station:
   Four: pos=(20,14), id=Id4
> route_earliest_arrival Id1 Id4 0000
No route found!
> # Test more
> add_train T24 Id2:0915 Id4:1501
1. Two (Id2) -> Four (Id4): T24 (at 0915)
2. Four (Id4): T24 (at 1501)
> add_train T34 Id2:0929 Id4:1400
1. Two (Id2) -> Four (Id4): T34 (at 0929)
2. Four (Id4): T34 (at 1400)
> add_train T242 Id2:1050 Id4:1500
1. Two (Id2) -> Four (Id4): T242 (at 1050)
2. Four (Id4): T242 (at 1500)
> add_train T122 Id1:0900 Id2:1040
1. One (Id1) -> Two (Id2): T122 (at 0900)
2. Two (Id2): T122 (at 1040)
> route_earliest_arrival Id2 Id4 0915
Total time for the route 4 hours 45 minutes.
1. Two (Id2) -> Four (Id4) (at 0929)
2. Four (Id4) (at 1400)
> route_earliest_arrival Id1 Id4 0831
Total time for the route 6 hours 29 minutes.
1. One (Id1) -> Two (Id2) (at 0900)
2. Two (Id2) -> Four (Id4) (at 1050)
3. Four (Id4) (at 1500)
> route_earliest_arrival Id1 Id4 0840
Total time for the route 6 hours 20 minutes.
1. One (Id1) -> Two (Id2) (at 0900)
2. Two (Id2) -> Four (Id4) (at 1050)
3. Four (Id4) (at 1500)
> route_earliest_arrival Id1 Id4 0920
Total time for the route 28 hours 40 minutes.
1. One (Id1) -> Two (Id2) (at 0800)
2. Two (Id2) -> Four (Id4) (at 0929)
3. Four (Id4) (at 1400)
> route_earliest_arrival Id3 Id2 0000
No route found!
> # testing route from the same station to the station
> route_earliest_arrival Id1 Id1 0000
No route found!
> 
